{
  "blogs": [
    {
      "title": "Ciao ragazzi",
      "body": "Mario is the main character and titular protagonist of the long-running and highly successful video game franchise of the same name. He was created by Japanese video game designer Shigeru Miyamoto and serves as the main mascot of Nintendo. Mario made his first appearance as the protagonist of the arcade game Donkey Kong, released in 1981 (in which he took the alias Jumpman). Since Super Mario Bros., his trademark abilities have been his jumping and stomping powers, with which he defeats most of his enemies, and his ability to gain even more powers with a plethora of items, such as the Super Mushroom, the Fire Flower, and the Super Star. Games have usually portrayed Mario as a silent, straightforward character. According to Nintendo's philosophy, this allows Mario to fit in many different genres and roles. In most games, he is the hero that goes on an adventure to save Princess Peach from his arch-nemesis, Bowser, but he has been shown doing many other activities besides adventuring, such as racing and sporting with his younger twin brother, Luigi; his friends such as Yoshi and Toad; and others. The above text is from the Super Mario Wiki and is available under a Creative Commons license. Attribution must be provided through a list of authors or a link back to the original article. Source: https://www.mariowiki.com/Mario",
      "author": "mario",
      "id": 1
    },
    {
      "title": "Welcome guys",
      "body": "Yoshi is a dinosaur-like character that acts as an ally of Mario and Luigi and is the protagonist of his own franchise. Among members of the Yoshi species hailing from Yoshi's Island, any Yoshi may be identified as the Yoshi character, and as such, not all iterations of the character are necessarily the same one. According to the Super Mario World manual, he got his name from Yoshi's Island because he was first discovered there.[1] In the Super Mario series, he often acts as a rideable character for the heroes, while in most of the spin-off games, he is a playable character on his own. Yoshi's defining traits include his cutesy appearance, his cheerful and friendly personality, his flutter-jumping and egg-laying abilities, his rideability as a steed, and exclaiming his own name. The above text is from the Super Mario Wiki and is available under a Creative Commons license. Attribution must be provided through a list of authors or a link back to the original article. Source: https://www.mariowiki.com/Yoshi",
      "author": "yoshi",
      "id": 2
    },
    {
      "title": "Get those stars",
      "body": "Luigi is Mario's slightly younger, taller fraternal twin brother and the deuteragonist of the Mario franchise. Throughout his life, he has lived in Mario's shadow, developing both cowardly and heroic tendencies. Despite this, Luigi has helped and fought alongside his brother on many occasions. Mario Bros. marks his first appearance in the Mario franchise and his debut in general. Originally an exact copy, then palette swap of Mario, Luigi was created to facilitate a second-player option. Since the two-player mode was dropped from most main Super Mario games beginning with Super Mario Land, Luigi has gained his own identity and personality, becoming a co-starring character of the Mario franchise. This is especially noticeable in installments for the Luigi's Mansion and the Mario & Luigi series of games. Luigi's notable traits include his green cap, his smooth mustache, his cowardly personality, his Italian accent, his heavy use of power-ups, and a superior jumping ability to Mario. The above text is from the Super Mario Wiki and is available under a Creative Commons license. Attribution must be provided through a list of authors or a link back to the original article. Source: https://www.mariowiki.com/Luigi",
      "author": "luigi",
      "id": 3
    }
  ],
  "comments": [
    {
      "_comment1": "Run the following from the root of your project folder: ",
      "_comment2": "npx json-server --watch data/db.json --port 8000",
      "_comment3": "Now `data/db.json` is wrapped by json-server API endpoints"
    }
  ]
}
